# Используем официальный образ Python 3.12 (slim для уменьшения размера)
FROM python:3.12-slim-bookworm

# Устанавливаем рабочую директорию в контейнере
WORKDIR /opt/vAPI/app

# Копируем файл зависимостей из корня контекста сборки
# в рабочую директорию контейнера (/opt/vAPI/app/)
COPY requirements.txt .

# Устанавливаем зависимости
RUN pip install --no-cache-dir -r requirements.txt

# Копируем содержимое папки 'app' из контекста сборки (вашей локальной папки 'app/')
# в рабочую директорию контейнера (/opt/vAPI/app/)
COPY app/ .

# Открываем порт, на котором будет работать приложение
EXPOSE 8081

# Команда для запуска приложения при старте контейнера
CMD ["python", "vAPI.py"]
